# Библиотека Pandas

## Data Frame

In [1]:
import pandas as pd

In [2]:
#создание DataFrame по столбцам с помощью словарей
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10, 'mumbers':range(10)})

In [3]:
frame

  chars  mumbers  numbers
0     a        0        0
1     a        1        1
2     a        2        2
3     a        3        3
4     a        4        4
5     a        5        5
6     a        6        6
7     a        7        7
8     a        8        8
9     a        9        9

In [4]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [5]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [6]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null object
City        6 non-null object
Position    4 non-null object
dtypes: object(4)
memory usage: 264.0+ bytes

In [24]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [25]:
frame.shape

(6, 4)

In [26]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}

In [27]:
#добавление строки в DataFrame
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [28]:
#добавление строки в DataFrame
frame = frame.append(new_line, ignore_index=True)

In [29]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [30]:
#добавление столбца в DataFrame
frame['IsStudent'] = [False]*5 + [True]*2

In [31]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6            Perov  22.03.1990      Penza       NaN       True

In [35]:
#удаление строк DataFrame
frame.drop([5,6], axis=0)

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [36]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6            Perov  22.03.1990      Penza       NaN       True

In [37]:
#удаление строк DataFrame (inplace)
frame.drop([5,6], axis=0, inplace=True)

In [38]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [39]:
#удаление столбца DataFrame (inplace)
frame.drop('IsStudent', axis=1, inplace=True)

In [44]:
frame

              Name       Birth       City
0      Иванов А.А.  22.03.1980     Москва
1     Сорокин И.В.  07.08.1965  Волгоград
2       Белов М.М.  13.02.1980     Ростов
3  Мельникова Д.С.  15.04.1985     Ростов
4      Рыбина Е.П.  19.11.1985     Москва

In [45]:
#удаление столбца DataFrame
frame = frame.drop('City', axis=1)

In [46]:
frame

              Name       Birth
0      Иванов А.А.  22.03.1980
1     Сорокин И.В.  07.08.1965
2       Белов М.М.  13.02.1980
3  Мельникова Д.С.  15.04.1985
4      Рыбина Е.П.  19.11.1985

In [53]:
#запись DataFrame в файл на Винде
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=False, encoding="CP1251")

In [54]:
!cat updated_dataset.csv

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [55]:
#аналог команды для пользователей Windows
!more updated_dataset.csv

Name,Birth
Иванов А.А.,22.03.1980
Сорокин И.В.,07.08.1965
Белов М.М.,13.02.1980
Мельникова Д.С.,15.04.1985
Рыбина Е.П.,19.11.1985

In [5]:
frame2 = pd.DataFrame({'Name':["Ferdi", "Nastya"], 'Age':["22", "18"], 'Student':[True, True]}, columns = ["Name", "Age", "Student"])

In [6]:
frame2

     Name Age  Student
0   Ferdi  22     True
1  Nastya  18     True

In [7]:
new_line2 = {"Name":"Misha", "Age":39, "Student":False}

In [8]:
type(new_line2)

dict

In [9]:
frame2 = frame2.append(new_line2, ignore_index=True)

In [10]:
frame2

     Name Age  Student
0   Ferdi  22     True
1  Nastya  18     True
2   Misha  39    False

In [82]:
frame2 = frame2.append(new_line2, ignore_index=True)

In [83]:
frame2

     Name Age  Student
0   Ferdi  22     True
1  Nastya  18     True
2   Misha  39    False
3   Misha  39    False

In [85]:
frame2.drop_duplicates()

     Name Age  Student
0   Ferdi  22     True
1  Nastya  18     True
2   Misha  39    False

In [91]:
frame2 = frame2.drop(2, axis=0)

In [92]:
frame2

     Name Age  Student
0   Ferdi  22     True
1  Nastya  18     True
3   Misha  39    False

In [94]:
frame2.drop(3, axis=0, inplace=True)

In [11]:
frame2

     Name Age  Student
0   Ferdi  22     True
1  Nastya  18     True
2   Misha  39    False

In [14]:
#запись DataFrame в файл на английском. На нем все круто
frame2.to_csv('one_more_updated_dataset.csv', sep='\t', header=True, index=False)

In [25]:
#создание DataFrame с помощью чтения данных из файла
frame3 = pd.read_csv('one_more_updated_dataset.csv', header=0, sep='\t')

In [26]:
frame3

     Name  Age  Student
0   Ferdi   22     True
1  Nastya   18     True
2   Misha   39    False

In [2]:
frame3 = pd.DataFrame({'Name':["Ferdi", "Nastya"], 'Age':["22", "18"], 'Student':[True, True]}, columns = ["Name", "Age", "Student"])

In [3]:
frame3

     Name Age  Student
0   Ferdi  22     True
1  Nastya  18     True

In [4]:
frame3.addColumn('IsStudent', [False, True])

AttributeError: 'DataFrame' object has no attribute 'addColumn'

In [6]:
frame3['IsStudent'] = [False, True]

In [7]:
frame3

     Name Age  Student  IsStudent
0   Ferdi  22     True      False
1  Nastya  18     True       True

In [8]:
new_line2 = {"Name":"Misha", "Age":39, "IsStudent":False}
frame3 = frame3.append(new_line2, ignore_index=True)

In [9]:
frame3

     Name Age  Student  IsStudent
0   Ferdi  22      1.0      False
1  Nastya  18      1.0       True
2   Misha  39      NaN      False

In [12]:
frame3 = frame3.drop(2, axis=0)
frame3['IsStudent'] = False, True

In [13]:
frame3

     Name Age  Student  IsStudent
0   Ferdi  22      1.0      False
1  Nastya  18      1.0       True

In [14]:
frame3 = frame3.drop("IsStudent", axis=1)

In [15]:
frame3

     Name Age  Student
0   Ferdi  22      1.0
1  Nastya  18      1.0

In [20]:
frame3['IsStudent'] = False True

SyntaxError: invalid syntax (<ipython-input-20-f8dbac294d6e>, line 1)

In [21]:
frame3

     Name Age  Student  IsStudent
0   Ferdi  22      1.0      False
1  Nastya  18      1.0       True